

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";



CREATE TABLE `contact` (
  `c_id` int(11) NOT NULL,
  `c_prefix` varchar(50) DEFAULT NULL,
  `c_firstname` varchar(255) DEFAULT NULL,
  `c_lastname` varchar(255) DEFAULT NULL,
  `c_birthdate` date DEFAULT NULL,

  `c_image` varchar(255) DEFAULT NULL,
  `c_status` tinyint(4) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



INSERT INTO `contact` (`c_id`, `c_prefix`, `c_firstname`, `c_lastname`, `c_birthdate`, `c_image`, `c_status`) VALUES
(1, 'นาย', 'คุณานนต์', 'คูณหอม', '1998-08-07', '20230924094602_64643.jpg', NULL),
(2, 'นาย', 'อุ่นใจ', 'ใจดี', '2023-06-16', '20230924095040_36848.jpg', NULL),
(3, 'นาง', 'ยินดี', 'ดีใจ', '1991-06-11', '20230924095108_26716.jpg', NULL),
(4, 'นางสาว', 'ขวัญ', 'ใจ', '2004-10-21', '20230924095315_18523.jpg', NULL),
(5, 'นางสาว', 'นก', 'เล็ก', '2005-05-29', '20230924095425_91388.jpg', NULL),
(6, 'นาง', 'แมว', 'จิรศักดิ์', '1994-09-09', '20230924095454_24727.jpg', NULL),
(7, 'นาย', 'ปัก', 'ธงชัย', '1981-07-05', '20230924095518_20578.jpg', NULL),
(8, 'นาย', 'พจน์', 'อานน', '2003-09-27', '20230924095556_95806.jpg', NULL),
(9, 'นาย', 'เพชร', 'ใหญ่', '2008-05-18', '20230924100021_43020.jpg', NULL),
(10, 'นาง', 'ใจ', 'เล็ก', '1991-10-22', '20230924100042_51456.jpg', NULL),
(11, 'นางสาว', 'มด', 'เเดง', '1976-11-26', '20230924100110_00358.jpg', NULL),
(12, 'นาย', 'น้ำ', 'เย็น', '1985-09-12', '20230924100139_69618.jpg', NULL),
(13, 'นาย', 'จอห์น', 'วินยู', '1990-12-31', '20230924100443_58733.', NULL),
(14, 'นาย', 'จอห์น', 'ชาวไร่', '1973-01-01', '20230924100407_04637.jpg', NULL),
(15, 'นางสาว', 'ออ', 'นิว', '2000-12-17', '20230924100827_43957.jpg', NULL),
(16, 'นางสาว', 'Lady', 'Gaga', '1988-07-14', '20230924100911_23395.jpg', NULL),
(17, 'นาย', 'Benjamin', 'Jr', '1997-08-09', '20230924101005_14263.jpg', NULL),
(18, 'นางสาว', 'สมชาย', 'ถูกใจ', '2005-10-28', '20230924101058_94232.jpg', NULL),
(19, 'นาง', 'สมศักดิ์', 'สมศรี', '2014-02-14', '20230924101156_14582.jpg', NULL),
(20, 'นางสาว', 'สมทรง', 'คงกระพันธุ์', '1998-07-01', '20230924101426_54283.jpg', NULL);

ALTER TABLE `contact`
  ADD PRIMARY KEY (`c_id`);


ALTER TABLE `contact`
  MODIFY `c_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
COMMIT;
